Repository: ai-chess-training/ChessApp
Catalog: iOS/ChessApp/App/Localizable.xcstrings
Source language: en
Languages: de, zh_hans

source: Account
de: Konto
zh_hans: 账户

source: API Base URL
de: API-Basis-URL
zh_hans: API基础URL

source: API Key (Optional)
de: API-Schlüssel (Optional)
zh_hans: API密钥（可选）

source: Appearance
de: Erscheinungsbild
zh_hans: 外观

source: Are you sure you want to reset the game? Your current progress will be lost.
de: Möchten Sie das Spiel wirklich zurücksetzen? Ihr aktueller Fortschritt geht verloren.
zh_hans: 确定要重置游戏吗？当前进度将会丢失。

source: Are you sure you want to resign? The opponent will win.
de: Möchten Sie wirklich aufgeben? Der Gegner gewinnt.
zh_hans: 确定要认输吗？对手将获胜。

source: Are you sure you want to sign out?
de: Möchten Sie sich wirklich abmelden?
zh_hans: 确定要退出登录吗？

source: Best line: %@
de: Beste Variante: %@
zh_hans: 最佳走法：%@

source: Better: %@
de: Besser: %@
zh_hans: 更好的走法：%@

source: Brightness
de: Helligkeit
zh_hans: 亮度

source: Cancel
de: Abbrechen
zh_hans: 取消

source: Captured Pieces
de: Geschlagene Figuren
zh_hans: 被吃棋子

source: Change Skill Level?
de: Schwierigkeitsgrad ändern?
zh_hans: 更改难度等级？

source: Changing to %@ requires resetting the game because a new coaching session will be created. This will start a fresh game at the new difficulty level.
de: Der Wechsel zu %@ erfordert ein Zurücksetzen des Spiels, da eine neue Coaching-Sitzung erstellt wird. Dies startet ein neues Spiel auf dem neuen Schwierigkeitsgrad.
zh_hans: 切换到%@需要重置游戏，因为将创建新的指导会话。这将以新的难度等级开始新游戏。

source: Check!
de: Schach!
zh_hans: 将军！

source: Checkmate! %@ wins!
de: Schachmatt! %@ gewinnt!
zh_hans: 将死！%@获胜！

source: Chess
de: Schach
zh_hans: 国际象棋

source: Chess Coach
de: Schachtrainer
zh_hans: 国际象棋教练

source: Chess Coach API
de: Schachtrainer-API
zh_hans: 国际象棋教练API

source: Choose a piece to promote to:
de: Wählen Sie eine Figur zur Umwandlung:
zh_hans: 选择升变棋子：

source: Choose your preferred app primary theme color or pick a custom one.
de: Wählen Sie Ihre bevorzugte Hauptfarbe oder eine benutzerdefinierte Farbe.
zh_hans: 选择您喜欢的应用主题颜色或自定义颜色。

source: Choose your preferred difficulty level for coaching.
de: Wählen Sie Ihren bevorzugten Schwierigkeitsgrad für das Coaching.
zh_hans: 选择您偏好的指导难度等级。

source: Concepts
de: Konzepte
zh_hans: 概念

source: Configure the Chess Coach backend server connection. Use localhost for local development or your Mac's IP address for testing on device.
de: Konfigurieren Sie die Verbindung zum Chess Coach Backend-Server. Verwenden Sie localhost für die lokale Entwicklung oder die IP-Adresse Ihres Macs zum Testen auf dem Gerät.
zh_hans: 配置国际象棋教练后端服务器连接。本地开发使用localhost，设备测试使用Mac的IP地址。

source: Connected
de: Verbunden
zh_hans: 已连接

source: Connection Test
de: Verbindungstest
zh_hans: 连接测试

source: Continue as Guest
de: Als Gast fortfahren
zh_hans: 以访客身份继续

source: Current Player:
de: Aktueller Spieler:
zh_hans: 当前玩家：

source: Custom
de: Benutzerdefiniert
zh_hans: 自定义

source: Custom Color
de: Benutzerdefinierte Farbe
zh_hans: 自定义颜色

source: Developer
de: Entwickler
zh_hans: 开发者

source: Disconnected
de: Getrennt
zh_hans: 未连接

source: Done
de: Fertig
zh_hans: 完成

source: Draw!
de: Remis!
zh_hans: 和棋！

source: Enable debug mode to show move history and additional development information during gameplay.
de: Aktivieren Sie den Debug-Modus, um die Zughistorie und zusätzliche Entwicklungsinformationen während des Spiels anzuzeigen.
zh_hans: 启用调试模式以在游戏过程中显示走棋历史和其他开发信息。

source: Enter API base URL
de: API-Basis-URL eingeben
zh_hans: 输入API基础URL

source: Enter API key
de: API-Schlüssel eingeben
zh_hans: 输入API密钥

source: Game Controls
de: Spielsteuerung
zh_hans: 游戏控制

source: Game Mode
de: Spielmodus
zh_hans: 游戏模式

source: Guest User
de: Gastbenutzer
zh_hans: 访客用户

source: Hue
de: Farbton
zh_hans: 色相

source: Make a move to receive coaching feedback
de: Machen Sie einen Zug, um Coaching-Feedback zu erhalten
zh_hans: 走一步棋以获取指导反馈

source: Move %lld
de: Zug %lld
zh_hans: 第%lld步

source: Move History
de: Zughistorie
zh_hans: 走棋历史

source: Move History (Debug)
de: Zughistorie (Debug)
zh_hans: 走过的棋子（调试）

source: OFF
de: AUS
zh_hans: 关闭

source: ON
de: AN
zh_hans: 开启

source: Pawn Promotion
de: Bauernumwandlung
zh_hans: 兵升变

source: Play chess with a fantastic mentor!
de: Spiele Schach mit einem fantastischen Mentor!
zh_hans: 与最棒的导师一起下棋！

source: Practice Suggestions
de: Übungsvorschläge
zh_hans: 练习建议

source: Quick Presets
de: Schnellvorlagen
zh_hans: 快速预设

source: Reset
de: Zurücksetzen
zh_hans: 重置

source: Reset & Change
de: Zurücksetzen & Ändern
zh_hans: 重置并更改

source: Reset & Switch
de: Zurücksetzen & Wechseln
zh_hans: 重置并切换

source: Reset Game
de: Spiel zurücksetzen
zh_hans: 重置游戏

source: Resign
de: Aufgeben
zh_hans: 认输

source: Resign Game
de: Spiel aufgeben
zh_hans: 认输

source: Retry
de: Erneut versuchen
zh_hans: 重试

source: Saturation
de: Sättigung
zh_hans: 饱和度

source: Save
de: Speichern
zh_hans: 保存

source: Session creation failed
de: Sitzungserstellung fehlgeschlagen
zh_hans: 会话创建失败

source: Settings
de: Einstellungen
zh_hans: 设置

source: Show Move History
de: Zughistorie anzeigen
zh_hans: 显示走棋历史

source: Sign In
de: Anmelden
zh_hans: 登录

source: Sign in to track your progress.
de: Melden Sie sich an, um Ihren Fortschritt zu verfolgen.
zh_hans: 登录以跟踪您的进度。

source: Sign in with Apple
de: Mit Apple anmelden
zh_hans: 通过Apple登录

source: Sign in with Google
de: Mit Google anmelden
zh_hans: 通过Google登录

source: Sign Out
de: Abmelden
zh_hans: 退出登录

source: Signed in with Apple
de: Mit Apple angemeldet
zh_hans: 已通过Apple登录

source: Skill Level
de: Schwierigkeitsgrad
zh_hans: 难度等级

source: Skill: %@
de: Stufe: %@
zh_hans: 难度：%@

source: Stalemate!
de: Patt!
zh_hans: 逼和！

source: Test Connection
de: Verbindung testen
zh_hans: 测试连接

source: Undo
de: Rückgängig
zh_hans: 悔棋

source: App Version
zh_hans: 应用版本

source: Debug: %@
zh_hans: 调试：%@
